; ModuleID = 'tests/test.cpp'
source_filename = "tests/test.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_istream" = type { i32 (...)**, i64, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !2, file: !3, line: 74, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "std", scope: null)
!3 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/iostream", directory: "")
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 626, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h", directory: "")
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
!7 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !8, producer: "clang version 14.0.0 (https://github.com/HPSSA-LLVM/llvm-project.git ddda52ce3cf2936d9ee05e06ed70e7d270cfcd73)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !9, imports: !10, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "tests/test.cpp", directory: "/home/clustfuzz/Documents/LLVM/HotPathSSALLVM/BallLarusProfiler")
!9 = !{!0}
!10 = !{!11, !31, !34, !39, !104, !112, !116, !123, !127, !131, !133, !135, !139, !148, !152, !158, !164, !166, !170, !174, !178, !182, !193, !195, !199, !203, !207, !209, !214, !218, !222, !224, !226, !230, !238, !242, !246, !250, !252, !258, !260, !267, !272, !276, !280, !284, !288, !292, !294, !296, !300, !304, !308, !310, !314, !318, !320, !322, !326, !332, !337, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !356, !360, !364, !369, !373, !376, !379, !382, !384, !386, !388, !391, !394, !397, !400, !403, !405, !410, !413, !416, !419, !421, !423, !425, !427, !430, !433, !436, !439, !442, !444, !448, !452, !457, !463, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !493, !497, !503, !507, !511, !516, !518, !523, !527, !531, !542, !544, !548, !552, !556, !560, !564, !568, !572, !576, !580, !584, !588, !590, !594, !598, !602, !608, !612, !616, !618, !622, !626, !632, !634, !638, !642, !646, !650, !654, !658, !662, !663, !664, !665, !667, !668, !669, !670, !671, !672, !673, !677, !683, !688, !692, !694, !696, !698, !700, !707, !711, !715, !719, !723, !727, !732, !736, !738, !742, !748, !752, !757, !759, !762, !766, !770, !772, !774, !776, !778, !782, !784, !786, !790, !794, !798, !802, !806, !810, !812, !816, !820, !824, !828, !830, !832, !836, !840, !841, !842, !843, !844, !845, !851, !854, !855, !857, !859, !861, !863, !867, !869, !871, !873, !875, !877, !879, !881, !883, !887, !891, !893, !897, !901}
!11 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !12, file: !30, line: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !13, line: 6, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !15, line: 21, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTS11__mbstate_t")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !16, file: !15, line: 15, baseType: !19, size: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !16, file: !15, line: 20, baseType: !21, size: 32, offset: 32)
!21 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !15, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTSN11__mbstate_tUt_E")
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !21, file: !15, line: 18, baseType: !24, size: 32)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !21, file: !15, line: 19, baseType: !26, size: 32)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !28)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !{!29}
!29 = !DISubrange(count: 4)
!30 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cwchar", directory: "")
!31 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !32, file: !30, line: 141)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !33, line: 20, baseType: !24)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!34 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !35, file: !30, line: 143)
!35 = !DISubprogram(name: "btowc", scope: !36, file: !36, line: 318, type: !37, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!36 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!37 = !DISubroutineType(types: !38)
!38 = !{!32, !19}
!39 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !40, file: !30, line: 144)
!40 = !DISubprogram(name: "fgetwc", scope: !36, file: !36, line: 726, type: !41, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!41 = !DISubroutineType(types: !42)
!42 = !{!32, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !45, line: 5, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !48, identifier: "_ZTS8_IO_FILE")
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !65, !67, !68, !69, !73, !75, !77, !81, !84, !86, !89, !92, !93, !95, !99, !100}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 51, baseType: !19, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 54, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 55, baseType: !51, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 56, baseType: !51, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 57, baseType: !51, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 58, baseType: !51, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 59, baseType: !51, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 60, baseType: !51, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 61, baseType: !51, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 64, baseType: !51, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 65, baseType: !51, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 66, baseType: !51, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 68, baseType: !63, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 70, baseType: !66, size: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 72, baseType: !19, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 73, baseType: !19, size: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 74, baseType: !70, size: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 152, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!72 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 77, baseType: !74, size: 16, offset: 1024)
!74 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 78, baseType: !76, size: 8, offset: 1040)
!76 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 79, baseType: !78, size: 8, offset: 1048)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 81, baseType: !82, size: 64, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 43, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 89, baseType: !85, size: 64, offset: 1152)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !71, line: 153, baseType: !72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !46, file: !47, line: 91, baseType: !87, size: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !47, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !46, file: !47, line: 92, baseType: !90, size: 64, offset: 1280)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !47, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !46, file: !47, line: 93, baseType: !66, size: 64, offset: 1344)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !46, file: !47, line: 94, baseType: !94, size: 64, offset: 1408)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 95, baseType: !96, size: 64, offset: 1472)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/local/lib/clang/14.0.0/include/stddef.h", directory: "")
!98 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 96, baseType: !19, size: 32, offset: 1536)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 98, baseType: !101, size: 160, offset: 1568)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 20)
!104 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !105, file: !30, line: 145)
!105 = !DISubprogram(name: "fgetws", scope: !36, file: !36, line: 755, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !110, !19, !111}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!111 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!112 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !113, file: !30, line: 146)
!113 = !DISubprogram(name: "fputwc", scope: !36, file: !36, line: 740, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!114 = !DISubroutineType(types: !115)
!115 = !{!32, !109, !43}
!116 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !117, file: !30, line: 147)
!117 = !DISubprogram(name: "fputws", scope: !36, file: !36, line: 762, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{!19, !120, !111}
!120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!123 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !124, file: !30, line: 148)
!124 = !DISubprogram(name: "fwide", scope: !36, file: !36, line: 573, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!125 = !DISubroutineType(types: !126)
!126 = !{!19, !43, !19}
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !128, file: !30, line: 149)
!128 = !DISubprogram(name: "fwprintf", scope: !36, file: !36, line: 580, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{!19, !111, !120, null}
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !132, file: !30, line: 150)
!132 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !36, file: !36, line: 640, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !134, file: !30, line: 151)
!134 = !DISubprogram(name: "getwc", scope: !36, file: !36, line: 727, type: !41, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !136, file: !30, line: 152)
!136 = !DISubprogram(name: "getwchar", scope: !36, file: !36, line: 733, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!137 = !DISubroutineType(types: !138)
!138 = !{!32}
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !140, file: !30, line: 153)
!140 = !DISubprogram(name: "mbrlen", scope: !36, file: !36, line: 329, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!96, !143, !96, !146}
!143 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!146 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !149, file: !30, line: 154)
!149 = !DISubprogram(name: "mbrtowc", scope: !36, file: !36, line: 296, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!150 = !DISubroutineType(types: !151)
!151 = !{!96, !110, !143, !96, !146}
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !153, file: !30, line: 155)
!153 = !DISubprogram(name: "mbsinit", scope: !36, file: !36, line: 292, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{!19, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !159, file: !30, line: 156)
!159 = !DISubprogram(name: "mbsrtowcs", scope: !36, file: !36, line: 337, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{!96, !110, !162, !96, !146}
!162 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !165, file: !30, line: 157)
!165 = !DISubprogram(name: "putwc", scope: !36, file: !36, line: 741, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !167, file: !30, line: 158)
!167 = !DISubprogram(name: "putwchar", scope: !36, file: !36, line: 747, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!32, !109}
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !171, file: !30, line: 160)
!171 = !DISubprogram(name: "swprintf", scope: !36, file: !36, line: 590, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{!19, !110, !96, !120, null}
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !175, file: !30, line: 162)
!175 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !36, file: !36, line: 647, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{!19, !120, !120, null}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !179, file: !30, line: 163)
!179 = !DISubprogram(name: "ungetwc", scope: !36, file: !36, line: 770, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!32, !32, !43}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !183, file: !30, line: 164)
!183 = !DISubprogram(name: "vfwprintf", scope: !36, file: !36, line: 598, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubroutineType(types: !185)
!185 = !{!19, !111, !120, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !188, identifier: "_ZTS13__va_list_tag")
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !187, file: !8, baseType: !24, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !187, file: !8, baseType: !24, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !187, file: !8, baseType: !94, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !187, file: !8, baseType: !94, size: 64, offset: 128)
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !194, file: !30, line: 166)
!194 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !36, file: !36, line: 693, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !196, file: !30, line: 169)
!196 = !DISubprogram(name: "vswprintf", scope: !36, file: !36, line: 611, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DISubroutineType(types: !198)
!198 = !{!19, !110, !96, !120, !186}
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !200, file: !30, line: 172)
!200 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !36, file: !36, line: 700, type: !201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubroutineType(types: !202)
!202 = !{!19, !120, !120, !186}
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !204, file: !30, line: 174)
!204 = !DISubprogram(name: "vwprintf", scope: !36, file: !36, line: 606, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{!19, !120, !186}
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !208, file: !30, line: 176)
!208 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !36, file: !36, line: 697, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !30, line: 178)
!210 = !DISubprogram(name: "wcrtomb", scope: !36, file: !36, line: 301, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{!96, !213, !109, !146}
!213 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !215, file: !30, line: 179)
!215 = !DISubprogram(name: "wcscat", scope: !36, file: !36, line: 97, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubroutineType(types: !217)
!217 = !{!108, !110, !120}
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !219, file: !30, line: 180)
!219 = !DISubprogram(name: "wcscmp", scope: !36, file: !36, line: 106, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{!19, !121, !121}
!222 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !223, file: !30, line: 181)
!223 = !DISubprogram(name: "wcscoll", scope: !36, file: !36, line: 131, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !225, file: !30, line: 182)
!225 = !DISubprogram(name: "wcscpy", scope: !36, file: !36, line: 87, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !227, file: !30, line: 183)
!227 = !DISubprogram(name: "wcscspn", scope: !36, file: !36, line: 187, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{!96, !121, !121}
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !231, file: !30, line: 184)
!231 = !DISubprogram(name: "wcsftime", scope: !36, file: !36, line: 834, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubroutineType(types: !233)
!233 = !{!96, !110, !96, !120, !234}
!234 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !36, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !239, file: !30, line: 185)
!239 = !DISubprogram(name: "wcslen", scope: !36, file: !36, line: 222, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubroutineType(types: !241)
!241 = !{!96, !121}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !243, file: !30, line: 186)
!243 = !DISubprogram(name: "wcsncat", scope: !36, file: !36, line: 101, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!108, !110, !120, !96}
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !247, file: !30, line: 187)
!247 = !DISubprogram(name: "wcsncmp", scope: !36, file: !36, line: 109, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubroutineType(types: !249)
!249 = !{!19, !121, !121, !96}
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !251, file: !30, line: 188)
!251 = !DISubprogram(name: "wcsncpy", scope: !36, file: !36, line: 92, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !253, file: !30, line: 189)
!253 = !DISubprogram(name: "wcsrtombs", scope: !36, file: !36, line: 343, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{!96, !213, !256, !96, !146}
!256 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !259, file: !30, line: 190)
!259 = !DISubprogram(name: "wcsspn", scope: !36, file: !36, line: 191, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !261, file: !30, line: 191)
!261 = !DISubprogram(name: "wcstod", scope: !36, file: !36, line: 377, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !120, !265}
!264 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!265 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !268, file: !30, line: 193)
!268 = !DISubprogram(name: "wcstof", scope: !36, file: !36, line: 382, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !120, !265}
!271 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !273, file: !30, line: 195)
!273 = !DISubprogram(name: "wcstok", scope: !36, file: !36, line: 217, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{!108, !110, !120, !265}
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !277, file: !30, line: 196)
!277 = !DISubprogram(name: "wcstol", scope: !36, file: !36, line: 428, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{!72, !120, !265, !19}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !281, file: !30, line: 197)
!281 = !DISubprogram(name: "wcstoul", scope: !36, file: !36, line: 433, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!98, !120, !265, !19}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !285, file: !30, line: 198)
!285 = !DISubprogram(name: "wcsxfrm", scope: !36, file: !36, line: 135, type: !286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{!96, !110, !120, !96}
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !289, file: !30, line: 199)
!289 = !DISubprogram(name: "wctob", scope: !36, file: !36, line: 324, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{!19, !32}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !293, file: !30, line: 200)
!293 = !DISubprogram(name: "wmemcmp", scope: !36, file: !36, line: 258, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !295, file: !30, line: 201)
!295 = !DISubprogram(name: "wmemcpy", scope: !36, file: !36, line: 262, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !297, file: !30, line: 202)
!297 = !DISubprogram(name: "wmemmove", scope: !36, file: !36, line: 267, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!108, !108, !121, !96}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !301, file: !30, line: 203)
!301 = !DISubprogram(name: "wmemset", scope: !36, file: !36, line: 271, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!108, !108, !109, !96}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !305, file: !30, line: 204)
!305 = !DISubprogram(name: "wprintf", scope: !36, file: !36, line: 587, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!19, !120, null}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !309, file: !30, line: 205)
!309 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !36, file: !36, line: 644, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !311, file: !30, line: 206)
!311 = !DISubprogram(name: "wcschr", scope: !36, file: !36, line: 164, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !121, !109}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !315, file: !30, line: 207)
!315 = !DISubprogram(name: "wcspbrk", scope: !36, file: !36, line: 201, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!108, !121, !121}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !319, file: !30, line: 208)
!319 = !DISubprogram(name: "wcsrchr", scope: !36, file: !36, line: 174, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !321, file: !30, line: 209)
!321 = !DISubprogram(name: "wcsstr", scope: !36, file: !36, line: 212, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !323, file: !30, line: 210)
!323 = !DISubprogram(name: "wmemchr", scope: !36, file: !36, line: 253, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{!108, !121, !109, !96}
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !328, file: !30, line: 251)
!327 = !DINamespace(name: "__gnu_cxx", scope: null)
!328 = !DISubprogram(name: "wcstold", scope: !36, file: !36, line: 384, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !120, !265}
!331 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !333, file: !30, line: 260)
!333 = !DISubprogram(name: "wcstoll", scope: !36, file: !36, line: 441, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !120, !265, !19}
!336 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !338, file: !30, line: 261)
!338 = !DISubprogram(name: "wcstoull", scope: !36, file: !36, line: 448, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !120, !265, !19}
!341 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !328, file: !30, line: 267)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !333, file: !30, line: 268)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !338, file: !30, line: 269)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !268, file: !30, line: 283)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !194, file: !30, line: 286)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !200, file: !30, line: 289)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !208, file: !30, line: 292)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !328, file: !30, line: 296)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !333, file: !30, line: 297)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !338, file: !30, line: 298)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !353, file: !354, line: 58)
!353 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !355, file: !354, line: 80, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!354 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/exception_ptr.h", directory: "")
!355 = !DINamespace(name: "__exception_ptr", scope: !2)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !355, entity: !357, file: !354, line: 74)
!357 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !354, line: 70, type: !358, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !353}
!360 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !361, entity: !362, file: !363, line: 58)
!361 = !DINamespace(name: "__gnu_debug", scope: null)
!362 = !DINamespace(name: "__debug", scope: !2)
!363 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !365, file: !368, line: 47)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !366, line: 24, baseType: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !71, line: 37, baseType: !76)
!368 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdint", directory: "")
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !370, file: !368, line: 48)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !366, line: 25, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !71, line: 39, baseType: !372)
!372 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !374, file: !368, line: 49)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !366, line: 26, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !71, line: 41, baseType: !19)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !377, file: !368, line: 50)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !366, line: 27, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !71, line: 44, baseType: !72)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !380, file: !368, line: 52)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !381, line: 58, baseType: !76)
!381 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !383, file: !368, line: 53)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !381, line: 60, baseType: !72)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !385, file: !368, line: 54)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !381, line: 61, baseType: !72)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !387, file: !368, line: 55)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !381, line: 62, baseType: !72)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !389, file: !368, line: 57)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !381, line: 43, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !71, line: 52, baseType: !367)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !392, file: !368, line: 58)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !381, line: 44, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !71, line: 54, baseType: !371)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !395, file: !368, line: 59)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !381, line: 45, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !71, line: 56, baseType: !375)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !398, file: !368, line: 60)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !381, line: 46, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !71, line: 58, baseType: !378)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !401, file: !368, line: 62)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !381, line: 101, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !71, line: 72, baseType: !72)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !404, file: !368, line: 63)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !381, line: 87, baseType: !72)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !406, file: !368, line: 65)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !407, line: 24, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !71, line: 38, baseType: !409)
!409 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !368, line: 66)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !407, line: 25, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !71, line: 40, baseType: !74)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !414, file: !368, line: 67)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !407, line: 26, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !71, line: 42, baseType: !24)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !368, line: 68)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !407, line: 27, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !71, line: 45, baseType: !98)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !420, file: !368, line: 70)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !381, line: 71, baseType: !409)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !422, file: !368, line: 71)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !381, line: 73, baseType: !98)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !424, file: !368, line: 72)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !381, line: 74, baseType: !98)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !426, file: !368, line: 73)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !381, line: 75, baseType: !98)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !428, file: !368, line: 75)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !381, line: 49, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !71, line: 53, baseType: !408)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !431, file: !368, line: 76)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !381, line: 50, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !71, line: 55, baseType: !412)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !434, file: !368, line: 77)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !381, line: 51, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !71, line: 57, baseType: !415)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !437, file: !368, line: 78)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !381, line: 52, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !71, line: 59, baseType: !418)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !440, file: !368, line: 80)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !381, line: 102, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !71, line: 73, baseType: !98)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !443, file: !368, line: 81)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !381, line: 90, baseType: !98)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !445, file: !447, line: 53)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !446, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!446 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!447 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/clocale", directory: "")
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !449, file: !447, line: 54)
!449 = !DISubprogram(name: "setlocale", scope: !446, file: !446, line: 122, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!450 = !DISubroutineType(types: !451)
!451 = !{!51, !19, !144}
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !453, file: !447, line: 55)
!453 = !DISubprogram(name: "localeconv", scope: !446, file: !446, line: 125, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(types: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !458, file: !462, line: 64)
!458 = !DISubprogram(name: "isalnum", scope: !459, file: !459, line: 108, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!460 = !DISubroutineType(types: !461)
!461 = !{!19, !19}
!462 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !462, line: 65)
!464 = !DISubprogram(name: "isalpha", scope: !459, file: !459, line: 109, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !466, file: !462, line: 66)
!466 = !DISubprogram(name: "iscntrl", scope: !459, file: !459, line: 110, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !468, file: !462, line: 67)
!468 = !DISubprogram(name: "isdigit", scope: !459, file: !459, line: 111, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !470, file: !462, line: 68)
!470 = !DISubprogram(name: "isgraph", scope: !459, file: !459, line: 113, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !472, file: !462, line: 69)
!472 = !DISubprogram(name: "islower", scope: !459, file: !459, line: 112, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !474, file: !462, line: 70)
!474 = !DISubprogram(name: "isprint", scope: !459, file: !459, line: 114, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !476, file: !462, line: 71)
!476 = !DISubprogram(name: "ispunct", scope: !459, file: !459, line: 115, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !478, file: !462, line: 72)
!478 = !DISubprogram(name: "isspace", scope: !459, file: !459, line: 116, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !480, file: !462, line: 73)
!480 = !DISubprogram(name: "isupper", scope: !459, file: !459, line: 117, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !482, file: !462, line: 74)
!482 = !DISubprogram(name: "isxdigit", scope: !459, file: !459, line: 118, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !484, file: !462, line: 75)
!484 = !DISubprogram(name: "tolower", scope: !459, file: !459, line: 122, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !486, file: !462, line: 76)
!486 = !DISubprogram(name: "toupper", scope: !459, file: !459, line: 125, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !488, file: !462, line: 87)
!488 = !DISubprogram(name: "isblank", scope: !459, file: !459, line: 130, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !490, file: !492, line: 52)
!490 = !DISubprogram(name: "abs", scope: !491, file: !491, line: 840, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!491 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!492 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !494, file: !496, line: 127)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !491, line: 62, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!496 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !498, file: !496, line: 128)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !491, line: 70, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !500, identifier: "_ZTS6ldiv_t")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !499, file: !491, line: 68, baseType: !72, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !499, file: !491, line: 69, baseType: !72, size: 64, offset: 64)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !504, file: !496, line: 130)
!504 = !DISubprogram(name: "abort", scope: !491, file: !491, line: 591, type: !505, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{null}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !508, file: !496, line: 132)
!508 = !DISubprogram(name: "aligned_alloc", scope: !491, file: !491, line: 586, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubroutineType(types: !510)
!510 = !{!94, !96, !96}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !512, file: !496, line: 134)
!512 = !DISubprogram(name: "atexit", scope: !491, file: !491, line: 595, type: !513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DISubroutineType(types: !514)
!514 = !{!19, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !517, file: !496, line: 137)
!517 = !DISubprogram(name: "at_quick_exit", scope: !491, file: !491, line: 600, type: !513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !519, file: !496, line: 140)
!519 = !DISubprogram(name: "atof", scope: !520, file: !520, line: 25, type: !521, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!521 = !DISubroutineType(types: !522)
!522 = !{!264, !144}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !524, file: !496, line: 141)
!524 = !DISubprogram(name: "atoi", scope: !491, file: !491, line: 361, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!19, !144}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !528, file: !496, line: 142)
!528 = !DISubprogram(name: "atol", scope: !491, file: !491, line: 366, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!529 = !DISubroutineType(types: !530)
!530 = !{!72, !144}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !532, file: !496, line: 143)
!532 = !DISubprogram(name: "bsearch", scope: !533, file: !533, line: 20, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!534 = !DISubroutineType(types: !535)
!535 = !{!94, !536, !536, !96, !96, !538}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !491, line: 808, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!19, !536, !536}
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !543, file: !496, line: 144)
!543 = !DISubprogram(name: "calloc", scope: !491, file: !491, line: 542, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !545, file: !496, line: 145)
!545 = !DISubprogram(name: "div", scope: !491, file: !491, line: 852, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubroutineType(types: !547)
!547 = !{!494, !19, !19}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !549, file: !496, line: 146)
!549 = !DISubprogram(name: "exit", scope: !491, file: !491, line: 617, type: !550, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !19}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !553, file: !496, line: 147)
!553 = !DISubprogram(name: "free", scope: !491, file: !491, line: 565, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !94}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !557, file: !496, line: 148)
!557 = !DISubprogram(name: "getenv", scope: !491, file: !491, line: 634, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubroutineType(types: !559)
!559 = !{!51, !144}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !561, file: !496, line: 149)
!561 = !DISubprogram(name: "labs", scope: !491, file: !491, line: 841, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!562 = !DISubroutineType(types: !563)
!563 = !{!72, !72}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !565, file: !496, line: 150)
!565 = !DISubprogram(name: "ldiv", scope: !491, file: !491, line: 854, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!566 = !DISubroutineType(types: !567)
!567 = !{!498, !72, !72}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !569, file: !496, line: 151)
!569 = !DISubprogram(name: "malloc", scope: !491, file: !491, line: 539, type: !570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{!94, !96}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !573, file: !496, line: 153)
!573 = !DISubprogram(name: "mblen", scope: !491, file: !491, line: 922, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{!19, !144, !96}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !577, file: !496, line: 154)
!577 = !DISubprogram(name: "mbstowcs", scope: !491, file: !491, line: 933, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{!96, !110, !143, !96}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !581, file: !496, line: 155)
!581 = !DISubprogram(name: "mbtowc", scope: !491, file: !491, line: 925, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!582 = !DISubroutineType(types: !583)
!583 = !{!19, !110, !143, !96}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !585, file: !496, line: 157)
!585 = !DISubprogram(name: "qsort", scope: !491, file: !491, line: 830, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !94, !96, !96, !538}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !589, file: !496, line: 160)
!589 = !DISubprogram(name: "quick_exit", scope: !491, file: !491, line: 623, type: !550, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !591, file: !496, line: 163)
!591 = !DISubprogram(name: "rand", scope: !491, file: !491, line: 453, type: !592, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!592 = !DISubroutineType(types: !593)
!593 = !{!19}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !595, file: !496, line: 164)
!595 = !DISubprogram(name: "realloc", scope: !491, file: !491, line: 550, type: !596, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!596 = !DISubroutineType(types: !597)
!597 = !{!94, !94, !96}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !599, file: !496, line: 165)
!599 = !DISubprogram(name: "srand", scope: !491, file: !491, line: 455, type: !600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !24}
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !603, file: !496, line: 166)
!603 = !DISubprogram(name: "strtod", scope: !491, file: !491, line: 117, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DISubroutineType(types: !605)
!605 = !{!264, !143, !606}
!606 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !609, file: !496, line: 167)
!609 = !DISubprogram(name: "strtol", scope: !491, file: !491, line: 176, type: !610, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DISubroutineType(types: !611)
!611 = !{!72, !143, !606, !19}
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !613, file: !496, line: 168)
!613 = !DISubprogram(name: "strtoul", scope: !491, file: !491, line: 180, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubroutineType(types: !615)
!615 = !{!98, !143, !606, !19}
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !617, file: !496, line: 169)
!617 = !DISubprogram(name: "system", scope: !491, file: !491, line: 784, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !619, file: !496, line: 171)
!619 = !DISubprogram(name: "wcstombs", scope: !491, file: !491, line: 936, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DISubroutineType(types: !621)
!621 = !{!96, !213, !120, !96}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !623, file: !496, line: 172)
!623 = !DISubprogram(name: "wctomb", scope: !491, file: !491, line: 929, type: !624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DISubroutineType(types: !625)
!625 = !{!19, !51, !109}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !627, file: !496, line: 200)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !491, line: 80, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !629, identifier: "_ZTS7lldiv_t")
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !628, file: !491, line: 78, baseType: !336, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !628, file: !491, line: 79, baseType: !336, size: 64, offset: 64)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !633, file: !496, line: 206)
!633 = !DISubprogram(name: "_Exit", scope: !491, file: !491, line: 629, type: !550, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !635, file: !496, line: 210)
!635 = !DISubprogram(name: "llabs", scope: !491, file: !491, line: 844, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!636 = !DISubroutineType(types: !637)
!637 = !{!336, !336}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !639, file: !496, line: 216)
!639 = !DISubprogram(name: "lldiv", scope: !491, file: !491, line: 858, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!640 = !DISubroutineType(types: !641)
!641 = !{!627, !336, !336}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !643, file: !496, line: 227)
!643 = !DISubprogram(name: "atoll", scope: !491, file: !491, line: 373, type: !644, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!644 = !DISubroutineType(types: !645)
!645 = !{!336, !144}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !647, file: !496, line: 228)
!647 = !DISubprogram(name: "strtoll", scope: !491, file: !491, line: 200, type: !648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!648 = !DISubroutineType(types: !649)
!649 = !{!336, !143, !606, !19}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !651, file: !496, line: 229)
!651 = !DISubprogram(name: "strtoull", scope: !491, file: !491, line: 205, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!652 = !DISubroutineType(types: !653)
!653 = !{!341, !143, !606, !19}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !655, file: !496, line: 231)
!655 = !DISubprogram(name: "strtof", scope: !491, file: !491, line: 123, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubroutineType(types: !657)
!657 = !{!271, !143, !606}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !327, entity: !659, file: !496, line: 232)
!659 = !DISubprogram(name: "strtold", scope: !491, file: !491, line: 126, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DISubroutineType(types: !661)
!661 = !{!331, !143, !606}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !627, file: !496, line: 240)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !633, file: !496, line: 242)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !635, file: !496, line: 244)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !666, file: !496, line: 245)
!666 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !327, file: !496, line: 213, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !639, file: !496, line: 246)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !643, file: !496, line: 248)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !655, file: !496, line: 249)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !647, file: !496, line: 250)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !651, file: !496, line: 251)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !659, file: !496, line: 252)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !674, file: !676, line: 98)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !675, line: 7, baseType: !46)
